s1 =  '*      *        *        * * * * *   * * * * *   *      *     **    *   * * * *   *           *     *      *   * * * *        *        *******   *'
s2 =  '*      *      *   *      *       *   *       *    *    *      * *   *   *          *         *       *    *    *            *   *      *     *   *'
s3 =  '********     *******     * * * * *   * * * * *     *  *       *  *  *   * * * *     *   *   *         *  *     * * * *     *******     ******    *'
s4 =  '*      *    *       *    *           *              *         *   * *   *            * * * *           *       *          *       *    *   *      '
s5 =  '*      *   *         *   *           *              *         *    **   * * * *       *   *            *       * * * *   *         *   *    *    *'
s6 = ''
s7 = ''
s8 = '                                                      * * * * *     * * * * *        *   * * * * * *                                               '
s9 = '                                                     *         *   *         *     * *             *                                               '
s10 = '                                                              *    *         *   *   *           *                                                 '
s11 = '                                                            *      *         *       *         *                                                   '
s12 = '                                                          *        *         *       *       *                                                     ' 
s13 = '                                                        *          *         *       *     *                                                       '
s14 = '                                                      * * * * *     * * * * *        *   *                                                         '
arr = [s1, s2, s3, s4, s5, s6, s7, s8, s9, s10, s11, s12, s13, s14]      # смотреть в полноэкранном терминале
loop do
	5.times do
	  puts
  end

	arr.each do |i|
		puts i
	end
	sleep 1
	system("cls") # если у вас linux, то cls заменить на clear
	sleep 1
end