Raddit/app/controllers/links_controller.rb

SELECT "links".* FROM "links" ORDER BY "links"."id" DESC
---
  def index
    @links = Link.all

INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Wikipadia"], ["url", "wikipedia.org"], ["created_at", 2017-01-08 06:54:08 UTC], ["updated_at", 2017-01-08 06:54:08 UTC], ["user_id", 1]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "url" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["url", "http://wikipedia.org"], ["updated_at", 2017-01-08 06:56:01 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def upvote
   @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def downvote
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_link
      @link = Link.find(params[:id])